FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/component/serial_manager/fsl_component_serial_manager.h
/*
 * Copyright 2018-2020 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef __SERIAL_MANAGER_H__
    #define __SERIAL_MANAGER_H__

    #include "fsl_common.h"

/*!
 * @addtogroup serialmanager
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/*! @brief Enable or disable serial manager non-blocking mode (1 - enable, 0 - disable) */
    #ifdef DEBUG_CONSOLE_TRANSFER_NON_BLOCKING
        #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE == 0U ) )
            #error When SERIAL_MANAGER_NON_BLOCKING_MODE=0, DEBUG_CONSOLE_TRANSFER_NON_BLOCKING can not be set.
        #else
            #define SERIAL_MANAGER_NON_BLOCKING_MODE    ( 1U )
        #endif
    #else
        #ifndef SERIAL_MANAGER_NON_BLOCKING_MODE
            #define SERIAL_MANAGER_NON_BLOCKING_MODE    ( 0U )
        #endif
    #endif

    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
/*! @brief Enable or disable serial manager dual(block and non-block) mode (1 - enable, 0 - disable) */
        #ifdef DEBUG_CONSOLE_TRANSFER_NON_BLOCKING
        #else
            #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
                #ifndef SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE
                    #define SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE    ( 1U )
                #endif
            #endif
        #endif
        #ifndef SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE
            #define SERIAL_MANAGER_NON_BLOCKING_DUAL_MODE    ( 0U )
        #endif
    #endif /* if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) ) */

/*! @brief Enable or disable uart port (1 - enable, 0 - disable) */
    #ifndef SERIAL_PORT_TYPE_UART
        #define SERIAL_PORT_TYPE_UART    ( 0U )
    #endif

/*! @brief Enable or disable USB CDC port (1 - enable, 0 - disable) */
    #ifndef SERIAL_PORT_TYPE_USBCDC
        #define SERIAL_PORT_TYPE_USBCDC    ( 0U )
    #endif

/*! @brief Enable or disable SWO port (1 - enable, 0 - disable) */
    #ifndef SERIAL_PORT_TYPE_SWO
        #define SERIAL_PORT_TYPE_SWO    ( 0U )
    #endif

/*! @brief Enable or disable USB CDC virtual port (1 - enable, 0 - disable) */
    #ifndef SERIAL_PORT_TYPE_VIRTUAL
        #define SERIAL_PORT_TYPE_VIRTUAL    ( 0U )
    #endif

/*! @brief Enable or disable rPMSG port (1 - enable, 0 - disable) */
    #ifndef SERIAL_PORT_TYPE_RPMSG
        #define SERIAL_PORT_TYPE_RPMSG    ( 0U )
    #endif

/*! @brief Enable or disable SerialManager_Task() handle TX to prevent recursive calling */
    #ifndef SERIAL_MANAGER_TASK_HANDLE_TX
        #define SERIAL_MANAGER_TASK_HANDLE_TX    ( 0U )
    #endif
    #if ( defined( SERIAL_MANAGER_TASK_HANDLE_TX ) && ( SERIAL_MANAGER_TASK_HANDLE_TX > 0U ) )
        #ifndef OSA_USED
            #error When SERIAL_MANAGER_TASK_HANDLE_TX=1, OSA_USED must be set.
        #endif
    #endif

/*! @brief Set the default delay time in ms used by SerialManager_WriteTimeDelay(). */
    #ifndef SERIAL_MANAGER_WRITE_TIME_DELAY_DEFAULT_VALUE
        #define SERIAL_MANAGER_WRITE_TIME_DELAY_DEFAULT_VALUE    ( 1U )
    #endif

/*! @brief Set the default delay time in ms used by SerialManager_ReadTimeDelay(). */
    #ifndef SERIAL_MANAGER_READ_TIME_DELAY_DEFAULT_VALUE
        #define SERIAL_MANAGER_READ_TIME_DELAY_DEFAULT_VALUE    ( 1U )
    #endif

/*! @brief Enable or disable SerialManager_Task() handle RX data available notify */
    #ifndef SERIAL_MANAGER_TASK_HANDLE_RX_AVAILABLE_NOTIFY
        #define SERIAL_MANAGER_TASK_HANDLE_RX_AVAILABLE_NOTIFY    ( 0U )
    #endif
    #if ( defined( SERIAL_MANAGER_TASK_HANDLE_RX_AVAILABLE_NOTIFY ) && ( SERIAL_MANAGER_TASK_HANDLE_RX_AVAILABLE_NOTIFY > 0U ) )
        #ifndef OSA_USED
            #error When SERIAL_MANAGER_TASK_HANDLE_RX_AVAILABLE_NOTIFY=1, OSA_USED must be set.
        #endif
    #endif

/*! @brief Set serial manager write handle size */
    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        #define SERIAL_MANAGER_WRITE_HANDLE_SIZE          ( 44U )
        #define SERIAL_MANAGER_READ_HANDLE_SIZE           ( 44U )
        #define SERIAL_MANAGER_WRITE_BLOCK_HANDLE_SIZE    ( 4U )
        #define SERIAL_MANAGER_READ_BLOCK_HANDLE_SIZE     ( 4U )
    #else
        #define SERIAL_MANAGER_WRITE_HANDLE_SIZE          ( 4U )
        #define SERIAL_MANAGER_READ_HANDLE_SIZE           ( 4U )
        #define SERIAL_MANAGER_WRITE_BLOCK_HANDLE_SIZE    ( 4U )
        #define SERIAL_MANAGER_READ_BLOCK_HANDLE_SIZE     ( 4U )
    #endif

    #if ( defined( SERIAL_PORT_TYPE_UART ) && ( SERIAL_PORT_TYPE_UART > 0U ) )
        #include "fsl_component_serial_port_uart.h"
    #endif

    #if ( defined( SERIAL_PORT_TYPE_RPMSG ) && ( SERIAL_PORT_TYPE_RPMSG > 0U ) )
        #include "fsl_component_serial_port_rpmsg.h"
    #endif

    #if ( defined( SERIAL_PORT_TYPE_USBCDC ) && ( SERIAL_PORT_TYPE_USBCDC > 0U ) )

        #if !( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
            #error The serial manager blocking mode cannot be supported for USB CDC.
        #endif

        #include "fsl_component_serial_port_usb.h"
    #endif

    #if ( defined( SERIAL_PORT_TYPE_SWO ) && ( SERIAL_PORT_TYPE_SWO > 0U ) )
        #include "fsl_component_serial_port_swo.h"
    #endif

    #if ( defined( SERIAL_PORT_TYPE_VIRTUAL ) && ( SERIAL_PORT_TYPE_VIRTUAL > 0U ) )

        #if !( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
            #error The serial manager blocking mode cannot be supported for USB CDC.
        #endif

        #include "fsl_component_serial_port_virtual.h"
    #endif

    #define SERIAL_MANAGER_HANDLE_SIZE_TEMP    0U
    #if ( defined( SERIAL_PORT_TYPE_UART ) && ( SERIAL_PORT_TYPE_UART > 0U ) )

        #if ( SERIAL_PORT_UART_HANDLE_SIZE > SERIAL_MANAGER_HANDLE_SIZE_TEMP )
            #undef SERIAL_MANAGER_HANDLE_SIZE_TEMP
            #define SERIAL_MANAGER_HANDLE_SIZE_TEMP    SERIAL_PORT_UART_HANDLE_SIZE
        #endif

    #endif

    #if ( defined( SERIAL_PORT_TYPE_USBCDC ) && ( SERIAL_PORT_TYPE_USBCDC > 0U ) )

