FreeRTOS/FreeRTOS/FreeRTOS/Demo/Safer_Interrupts_M33F_NXP_LPC55S69_MCUXpresso/NXP_Code/component/serial_manager/fsl_component_serial_manager.h
        #if ( SERIAL_PORT_USB_CDC_HANDLE_SIZE > SERIAL_MANAGER_HANDLE_SIZE_TEMP )
            #undef SERIAL_MANAGER_HANDLE_SIZE_TEMP
            #define SERIAL_MANAGER_HANDLE_SIZE_TEMP    SERIAL_PORT_USB_CDC_HANDLE_SIZE
        #endif

    #endif

    #if ( defined( SERIAL_PORT_TYPE_SWO ) && ( SERIAL_PORT_TYPE_SWO > 0U ) )

        #if ( SERIAL_PORT_SWO_HANDLE_SIZE > SERIAL_MANAGER_HANDLE_SIZE_TEMP )
            #undef SERIAL_MANAGER_HANDLE_SIZE_TEMP
            #define SERIAL_MANAGER_HANDLE_SIZE_TEMP    SERIAL_PORT_SWO_HANDLE_SIZE
        #endif

    #endif

    #if ( defined( SERIAL_PORT_TYPE_VIRTUAL ) && ( SERIAL_PORT_TYPE_VIRTUAL > 0U ) )

        #if ( SERIAL_PORT_VIRTUAL_HANDLE_SIZE > SERIAL_MANAGER_HANDLE_SIZE_TEMP )
            #undef SERIAL_MANAGER_HANDLE_SIZE_TEMP
            #define SERIAL_MANAGER_HANDLE_SIZE_TEMP    SERIAL_PORT_VIRTUAL_HANDLE_SIZE
        #endif

    #endif

    #if ( defined( SERIAL_PORT_TYPE_RPMSG ) && ( SERIAL_PORT_TYPE_RPMSG > 0U ) )

        #if ( SERIAL_PORT_RPMSG_HANDLE_SIZE > SERIAL_MANAGER_HANDLE_SIZE_TEMP )
            #undef SERIAL_MANAGER_HANDLE_SIZE_TEMP
            #define SERIAL_MANAGER_HANDLE_SIZE_TEMP    SERIAL_PORT_RPMSG_HANDLE_SIZE

        #endif

    #endif

/*! @brief SERIAL_PORT_UART_HANDLE_SIZE/SERIAL_PORT_USB_CDC_HANDLE_SIZE + serial manager dedicated size */
    #if ( ( defined( SERIAL_MANAGER_HANDLE_SIZE_TEMP ) && ( SERIAL_MANAGER_HANDLE_SIZE_TEMP > 0U ) ) )
    #else
        #error SERIAL_PORT_TYPE_UART, SERIAL_PORT_TYPE_USBCDC, SERIAL_PORT_TYPE_SWO and SERIAL_PORT_TYPE_VIRTUAL should not be cleared at same time.
    #endif

    #if defined( OSA_USED )
        #include "fsl_component_common_task.h"
    #endif
/*! @brief Macro to determine whether use common task. */
    #ifndef SERIAL_MANAGER_USE_COMMON_TASK
        #define SERIAL_MANAGER_USE_COMMON_TASK        ( 0U )
        #if ( defined( COMMON_TASK_ENABLE ) && ( COMMON_TASK_ENABLE == 0U ) )
            #undef SERIAL_MANAGER_USE_COMMON_TASK
            #define SERIAL_MANAGER_USE_COMMON_TASK    ( 0U )
        #endif
    #endif

    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        #if ( defined( OSA_USED ) && !( defined( SERIAL_MANAGER_USE_COMMON_TASK ) && ( SERIAL_MANAGER_USE_COMMON_TASK > 0U ) ) )
            #include "fsl_os_abstraction.h"
        #endif
    #endif

    #if defined( OSA_USED )
        #include "fsl_component_common_task.h"
    #endif
/*! @brief Macro to determine whether use common task. */
    #ifndef SERIAL_MANAGER_USE_COMMON_TASK
        #define SERIAL_MANAGER_USE_COMMON_TASK        ( 0U )
        #if ( defined( COMMON_TASK_ENABLE ) && ( COMMON_TASK_ENABLE == 0U ) )
            #undef SERIAL_MANAGER_USE_COMMON_TASK
            #define SERIAL_MANAGER_USE_COMMON_TASK    ( 0U )
        #endif
    #endif

    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        #if ( defined( OSA_USED ) && !( defined( SERIAL_MANAGER_USE_COMMON_TASK ) && ( SERIAL_MANAGER_USE_COMMON_TASK > 0U ) ) )
            #include "fsl_os_abstraction.h"
        #endif
    #endif

/*! @brief Definition of serial manager handle size. */
    #if ( defined( SERIAL_MANAGER_NON_BLOCKING_MODE ) && ( SERIAL_MANAGER_NON_BLOCKING_MODE > 0U ) )
        #if ( defined( OSA_USED ) && !( defined( SERIAL_MANAGER_USE_COMMON_TASK ) && ( SERIAL_MANAGER_USE_COMMON_TASK > 0U ) ) )
            #define SERIAL_MANAGER_HANDLE_SIZE \
    ( SERIAL_MANAGER_HANDLE_SIZE_TEMP + 124U + OSA_TASK_HANDLE_SIZE + OSA_EVENT_HANDLE_SIZE )
        #else /*defined(OSA_USED)*/
            #define SERIAL_MANAGER_HANDLE_SIZE      ( SERIAL_MANAGER_HANDLE_SIZE_TEMP + 124U )
        #endif /*defined(OSA_USED)*/
        #define SERIAL_MANAGER_BLOCK_HANDLE_SIZE    ( SERIAL_MANAGER_HANDLE_SIZE_TEMP + 16U )
    #else
        #define SERIAL_MANAGER_HANDLE_SIZE          ( SERIAL_MANAGER_HANDLE_SIZE_TEMP + 12U )
        #define SERIAL_MANAGER_BLOCK_HANDLE_SIZE    ( SERIAL_MANAGER_HANDLE_SIZE_TEMP + 12U )
    #endif

/*!
 * @brief Defines the serial manager handle
 *
 * This macro is used to define a 4 byte aligned serial manager handle.
 * Then use "(serial_handle_t)name" to get the serial manager handle.
 *
 * The macro should be global and could be optional. You could also define serial manager handle by yourself.
 *
 * This is an example,
 * @code
 * SERIAL_MANAGER_HANDLE_DEFINE(serialManagerHandle);
 * @endcode
 *
 * @param name The name string of the serial manager handle.
 */
    #define SERIAL_MANAGER_HANDLE_DEFINE( name ) \
    uint32_t name[ ( ( SERIAL_MANAGER_HANDLE_SIZE + sizeof( uint32_t ) - 1U ) / sizeof( uint32_t ) ) ]
    #define SERIAL_MANAGER_BLOCK_HANDLE_DEFINE( name ) \
    uint32_t name[ ( ( SERIAL_MANAGER_BLOCK_HANDLE_SIZE + sizeof( uint32_t ) - 1U ) / sizeof( uint32_t ) ) ]

/*!
 * @brief Defines the serial manager write handle
 *
 * This macro is used to define a 4 byte aligned serial manager write handle.
 * Then use "(serial_write_handle_t)name" to get the serial manager write handle.
 *
 * The macro should be global and could be optional. You could also define serial manager write handle by yourself.
 *
 * This is an example,
 * @code
 * SERIAL_MANAGER_WRITE_HANDLE_DEFINE(serialManagerwriteHandle);
 * @endcode
 *
 * @param name The name string of the serial manager write handle.
 */
    #define SERIAL_MANAGER_WRITE_HANDLE_DEFINE( name ) \
    uint32_t name[ ( ( SERIAL_MANAGER_WRITE_HANDLE_SIZE + sizeof( uint32_t ) - 1U ) / sizeof( uint32_t ) ) ]
    #define SERIAL_MANAGER_WRITE_BLOCK_HANDLE_DEFINE( name ) \
    uint32_t name[ ( ( SERIAL_MANAGER_WRITE_BLOCK_HANDLE_SIZE + sizeof( uint32_t ) - 1U ) / sizeof( uint32_t ) ) ]

/*!
 * @brief Defines the serial manager read handle
 *
 * This macro is used to define a 4 byte aligned serial manager read handle.
 * Then use "(serial_read_handle_t)name" to get the serial manager read handle.
 *
 * The macro should be global and could be optional. You could also define serial manager read handle by yourself.
 *
 * This is an example,
 * @code
 * SERIAL_MANAGER_READ_HANDLE_DEFINE(serialManagerReadHandle);
 * @endcode
 *
 * @param name The name string of the serial manager read handle.
 */
    #define SERIAL_MANAGER_READ_HANDLE_DEFINE( name ) \
    uint32_t name[ ( ( SERIAL_MANAGER_READ_HANDLE_SIZE + sizeof( uint32_t ) - 1U ) / sizeof( uint32_t ) ) ]
    #define SERIAL_MANAGER_READ_BLOCK_HANDLE_DEFINE( name ) \
    uint32_t name[ ( ( SERIAL_MANAGER_READ_BLOCK_HANDLE_SIZE + sizeof( uint32_t ) - 1U ) / sizeof( uint32_t ) ) ]

/*! @brief Macro to set serial manager task priority. */
    #ifndef SERIAL_MANAGER_TASK_PRIORITY
        #define SERIAL_MANAGER_TASK_PRIORITY    ( 2U )
    #endif

/*! @brief Macro to set serial manager task stack size. */
    #ifndef SERIAL_MANAGER_TASK_STACK_SIZE
        #define SERIAL_MANAGER_TASK_STACK_SIZE    ( 1000U )
    #endif

/*! @brief The handle of the serial manager module */
    typedef void   * serial_handle_t;

